In [26]:
import pandas as pd

def get_distance(point1, point2):
    """Gets the coordinates of two points as two lists, and outputs their distance"""
    return (((point1[0] - point2[0]) ** 2 + (point1[1] - point2[1]) ** 2 + (point1[2] - point2[2]) ** 2) ** 0.5)

#Dataframe of coordinates.    
df = pd.DataFrame({"No.": [25, 36, 70, 95, 112, 101, 121, 201], "x": [1,2,3,4,2,3,4,5], "y": [2,3,4,5,3,4,5,6], "z": [3,4,5,6,4,5,6,7]})

#Dataframe to be filled with each pair distance.
df_dist = pd.DataFrame({'target': [112, 101, 121, 201]}, columns=["target", 25, 36, 70, 95])
df_dist.set_index("target", inplace = True)

In [27]:
import numpy as np

In [31]:
points=[25, 36, 70, 95, 112, 101, 121, 201]

In [33]:
p1 =  [points.index(num) for num in [112, 101, 121, 201]]
p2 =  [points.index(num) for num in [25, 36, 70, 95]]

In [35]:
from itertools import product

In [36]:
product(p1,p2)

In [25]:
df_dist

         25   36   70   95
target
112     NaN  NaN  NaN  NaN
101     NaN  NaN  NaN  NaN
121     NaN  NaN  NaN  NaN
201     NaN  NaN  NaN  NaN

In [15]:
i, j = np.where(1 - np.eye(len(df)))
df=df.iloc[i].reset_index(drop=True).join(
    df.iloc[j].reset_index(drop=True), rsuffix='_2')

In [22]:
df['distance'] = get_distance([df['x'],df['y'],df['z']], [df['x_2'],df['y_2'],df['z_2']])
df.head()

   No.  x  y  z  No._2  x_2  y_2  z_2  distance
0   25  1  2  3     36    2    3    4  1.732051
1   25  1  2  3     70    3    4    5  3.464102
2   25  1  2  3     95    4    5    6  5.196152
3   25  1  2  3    112    2    3    4  1.732051
4   25  1  2  3    101    3    4    5  3.464102

In [30]:
np.where(1 - np.eye(len(df)))

(array([0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3,
        3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 6, 6,
        6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 7, 7]),
 array([1, 2, 3, 4, 5, 6, 7, 0, 2, 3, 4, 5, 6, 7, 0, 1, 3, 4, 5, 6, 7, 0,
        1, 2, 4, 5, 6, 7, 0, 1, 2, 3, 5, 6, 7, 0, 1, 2, 3, 4, 6, 7, 0, 1,
        2, 3, 4, 5, 7, 0, 1, 2, 3, 4, 5, 6]))

In [39]:
df.describe()

              No.         x         y         z
count    8.000000  8.000000  8.000000  8.000000
mean    95.125000  3.000000  4.000000  5.000000
std     55.088079  1.309307  1.309307  1.309307
min     25.000000  1.000000  2.000000  3.000000
25%     61.500000  2.000000  3.000000  4.000000
50%     98.000000  3.000000  4.000000  5.000000
75%    114.250000  4.000000  5.000000  6.000000
max    201.000000  5.000000  6.000000  7.000000

In [40]:
df.agg([min,max],axis=1)

   min  max
0    1   25
1    2   36
2    3   70
3    4   95
4    2  112
5    3  101
6    4  121
7    5  201